---
type: CameraInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# CameraInfo

`Autodesk.Revit.DB.CameraInfo` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | FarDistance | 2014 | `public double FarDistance { get ; }` |
| Property | HorizontalExtent | 2014 | `public double HorizontalExtent { get ; }` |
| Property | IsPerspective | 2016 | `public bool IsPerspective { get ; }` |
| Property | IsPespective | 2014 | `public bool IsPespective { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NearDistance | 2014 | `public double NearDistance { get ; }` |
| Property | RightOffset | 2014 | `public double RightOffset { get ; }` |
| Property | TargetDistance | 2014 | `public double TargetDistance { get ; }` |
| Property | UpOffset | 2014 | `public double UpOffset { get ; }` |
| Property | VerticalExtent | 2014 | `public double VerticalExtent { get ; }` |